In [6]:
import pandas as pd
import numpy as np

In [3]:
index = pd.date_range('1/1/2000', periods=8)

In [4]:
index

DatetimeIndex(['2000-01-01', '2000-01-02', '2000-01-03', '2000-01-04',
               '2000-01-05', '2000-01-06', '2000-01-07', '2000-01-08'],
              dtype='datetime64[ns]', freq='D')

In [9]:
s = pd.Series(np.random.randn(5), index=['a', 'b', 'c', 'd', 'e'])

In [25]:
s

a    0.036076
b    0.383654
c   -1.885722
d    0.889981
e   -0.878771
dtype: float64

In [11]:
df = pd.DataFrame(np.random.randn(8, 3), index=index, columns=['A', 'B', 'C'])

In [13]:
df

                   A         B         C
2000-01-01  0.421836 -0.083742  0.270983
2000-01-02  1.801110  0.019997 -1.244011
2000-01-03 -2.636994 -0.453341 -1.180604
2000-01-04 -2.092750  0.140425 -0.215607
2000-01-05  0.658749 -1.111177 -1.147390
2000-01-06 -0.734649 -0.035853 -2.141690
2000-01-07  0.049359 -1.098155 -0.066650
2000-01-08  0.309807 -1.944200  0.381796

## df切片

In [19]:
df[::-1]

                   A         B         C
2000-01-08  0.309807 -1.944200  0.381796
2000-01-07  0.049359 -1.098155 -0.066650
2000-01-06 -0.734649 -0.035853 -2.141690
2000-01-05  0.658749 -1.111177 -1.147390
2000-01-04 -2.092750  0.140425 -0.215607
2000-01-03 -2.636994 -0.453341 -1.180604
2000-01-02  1.801110  0.019997 -1.244011
2000-01-01  0.421836 -0.083742  0.270983

## column传入函数

In [21]:
df.columns = [x.lower() for x in df.columns]
df

                   a         b         c
2000-01-01  0.421836 -0.083742  0.270983
2000-01-02  1.801110  0.019997 -1.244011
2000-01-03 -2.636994 -0.453341 -1.180604
2000-01-04 -2.092750  0.140425 -0.215607
2000-01-05  0.658749 -1.111177 -1.147390
2000-01-06 -0.734649 -0.035853 -2.141690
2000-01-07  0.049359 -1.098155 -0.066650
2000-01-08  0.309807 -1.944200  0.381796